CodeArchiver/app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES('Math', '2010-03-22 12:40:49', '2010-03-22 12:40:49')