CodeArchiver/app/controllers/codes_controller.rb

  def index

    if(params[:page].nil?)
      params[:page] = 1;
    end
    @searchON = false
    if (!params[:search].nil?)
      @codes = Code.search params[:search][:text]
---
SELECT * FROM `codes`

      @codesXML = @codes

      for @codeXML in @codesXML
        @codeXML.program_language_id = ProgramLanguage.find(@codeXML.program_language_id).language_name
        @codeXML.category_id = Category.find(@codeXML.category_id).name
---
SELECT * FROM `program_languages` WHERE (`program_languages`.`id` = 1)
SELECT * FROM `categories` WHERE (`categories`.`id` = 5)

  def show
    @code = Code.find(params[:id])
    @canedit = isCurrentUserAuthorOrAdmin(@code.user_id, session[:user_id])
    @cancomment = isUserLoggedIn(session[:user_id])
    @isPrivate = @code.private


    @isReplyToCode = CodeReply.find(:first, :conditions => {:child_id => @code.id})
---
SELECT * FROM `codes` WHERE (`codes`.`id` = 2)
SELECT * FROM `users` WHERE (`users`.`id` = 1)

    @grades = Grade.find(:all , :conditions => {:code_id => @code.id})

    # prog_lang_brush potrebujemo za barvanje sintakse
    @prog_lang_brush = ProgramLanguage.find (@code.program_language_id).syntax_tag
---
SELECT * FROM `program_languages` WHERE (`program_languages`.`id` = 1)

  def create
    # authenticate user
    if session[:user_id].nil? then # is user not logged in?
       flash[:notice] = "You are not logged in."
       redirect_to :controller => 'sessions', :action => 'create'
    end

    @code = Code.new(params[:code])
    desc = @code.description
    puts "--------------------------------------------------------------------------------------------------------"
    puts desc

    @code.description = desc.gsub("\n","<br/>")

    puts "------------------------------------------------------------------------------------------------------"
   # puts desc

    if @code.private == nil
	     @code.private = false
    end

    @code.user_id = session[:user_id] # gets user id from session (user current logged in) and sets is to code


    @code.views=0
    respond_to do |format|
      if @code.save   #if code is saved and code is response to other code
---
INSERT INTO `codes` (`program_language_id`, `created_at`, `title`, `code_body`, `shortdescription`, `updated_at`, `tag`, `type_id`, `user_id`, `category_id`, `description`) VALUES(NULL, '2010-03-23 12:37:35', 'HalloWorld(c++)', '', '', '2010-03-23 12:37:35', '', NULL, NULL, NULL, '')

  def destroy
    @code = Code.find(params[:id])
    @code.destroy
---
SELECT * FROM `codes` WHERE (`codes`.`id` = 2)
DELETE FROM `codes` WHERE `id` = 2