CodeArchiver/app/controllers/profiles_controller.rb

  def index

    @profiles = Profile.all
---
SELECT * FROM `profiles`

  def show
    #@profile = Profile.find(params[:id])
    @profile = Profile.find(:first, :conditions => {:user_id => session[:user_id]} )
---
SELECT * FROM `profiles` WHERE (`profiles`.`id` = 1)

  def create
    @profile = Profile.new(params[:profile])

    respond_to do |format|
      if @profile.save
---
INSERT INTO `profiles` (`company`, `portfolio`, `created_at`, `updated_at`, `IM`, `avatar`, `webpage`, `email`) VALUES('nimam.DD', 'zacel sem ko sem bil majhen', '2010-03-22 14:21:27', '2010-03-22 14:21:27', 'jernejh....', '', '', 'jernej.halozan{fasf')