CodeArchiver/app/controllers/program_languages_controller.rb

  def index
    @program_languages = ProgramLanguage.all
---
SELECT * FROM `program_languages`

  def show
    @program_language = ProgramLanguage.find(params[:id])
---
SELECT * FROM `program_languages` WHERE (`program_languages`.`id` = 1)

  def create
    @program_language = ProgramLanguage.new(params[:program_language])

    respond_to do |format|
      if @program_language.save
---
INSERT INTO `program_languages` (`reservered_words`, `created_at`, `updated_at`, `language_name`) VALUES('int, while, for, do, register', '2010-03-23 12:32:52', '2010-03-23 12:32:52', 'c++')