CodeArchiver/app/controllers/types_controller.rb

  def index
    @types = Type.all
---
SELECT * FROM `types`

  def show
    @type = Type.find(params[:id])
---
SELECT * FROM `types` WHERE (`types`.`id` = 1)

  def create
    @type = Type.new(params[:type])

    respond_to do |format|
      if @type.save
---
INSERT INTO `types` (`name`, `created_at`, `updated_at`) VALUES('Algorithm', '2010-03-22 12:40:12', '2010-03-22 12:40:12')