CodeArchiver/app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `updated_at`, `username`, `password_salt`, `password_hash`, `email`) VALUES('2010-03-25 16:59:58', '2010-03-25 16:59:58', 'jerry', 'ba97b122f87d7bea5b529c3acf0b7bdf66e07470', 'ce7ae0140672aafd6f59ce26a6503d8f0a94d2c4', 'jernej.halozan@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def show
    @user = User.find(:first, :conditions => {:username => params[:username]})