trunk/CodeArchiver/app/controllers/profiles_controller.rb

SELECT * FROM `profiles`
---
  def index
    @profiles = Profile.all

SELECT * FROM `profiles` WHERE (`profiles`.`id` = 1)
---
  def show
    #@profile = Profile.find(params[:id])

    @codes = Code.find(:all, :conditions => {:user_id => session[:user_id]}) # Get ALL codes, even private, since this is user's private code view

    @listing = 10
    if !session[:user_id].nil? then
      @activeProfile = Profile.find session[:user_id]

INSERT INTO `profiles` (`company`, `portfolio`, `created_at`, `updated_at`, `IM`, `avatar`, `webpage`, `email`) VALUES('nimam.DD', 'zacel sem ko sem bil majhen', '2010-03-22 14:21:27', '2010-03-22 14:21:27', 'jernejh....', '', '', 'jernej.halozan{fasf')
---
  def create
    @profile = Profile.new(params[:profile])

    respond_to do |format|
      if @profile.save