trunk/CodeArchiver/app/controllers/subcategories_controller.rb

  def index
    @subcategories = Subcategory.all
---
SELECT * FROM `subcategories`

  def show
    @subcategory = Subcategory.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `subcategories` WHERE (`subcategories`.`id` = 1)

  def create
    @subcategory = Subcategory.new(params[:subcategory])

    respond_to do |format|
      if @subcategory.save
---
INSERT INTO `subcategories` (`created_at`, `updated_at`, `category_id`, `child_id`) VALUES('2010-03-23 12:10:48', '2010-03-23 12:10:48', 1, 123)