trunk/CodeArchiver/app/controllers/types_controller.rb

SELECT * FROM `types`
---
  def index
    @types = Type.all

SELECT * FROM `types` WHERE (`types`.`id` = 1)
---
  def show
    @type = Type.find(params[:id])

INSERT INTO `types` (`name`, `created_at`, `updated_at`) VALUES('Algorithm', '2010-03-22 12:40:12', '2010-03-22 12:40:12')
---
  def create
    @type = Type.new(params[:type])

	#
    @admin_log = AdminLog.new(:aid=> session[:user_id], :controller => "types_controller", :action => "create")
    @admin_log.save